%Δημιουργώ τυχαία 10.000 δείγματα εκθετικής κατανομής σύμφωνα με την
%εκφώνηση της άσκησης. Ετσι δημιουργείται το διάνυσμα της πηγής Α.
M=10000;
t = (randn(M,1)+j*randn(M,1))/sqrt(2);
x=abs(t).^2;
%Στην συνέχεια πραγματοποιούμε την ομοιόμορφη κβάντιση της πηγής Α για Ν=4 και 6 bits  
[xq_4_bits, centers_4_bits, offside(2), step(2), space_p4] = my_quantizer(x, 4, 0, 4);
[xq_6_bits, centers_6_bits, offside(3), step(3), space_p6] = my_quantizer(x, 6, 0, 4);
%-------------------------------------------------------------------------%
%Ερώτημα 1-(a): Στο ερώτημα αυτό μας ζητείται να υπολογίσουμε το πειραματικο
%και το θεωρητικό sqnr εκφρασμένο σε db. Δημιουργούμε 2 διανύσματα τα 
%sqnr_exper, sqnr_theor αντίστοιχα με σκοπό να καταχωρήσουμε εκει τις 
%τιμές. Στην συνέχεια καλούμε την συνάρτηση sqnr που μας υπολογίζει τις 
%τιμές αυτές αφού τις έχουμε ορίσει τα bits κβάντισης καθώς και την περιοχή 
%στην οποία ορίζεται ο ομοιόμορφος κβαντιστής.
sqnr_exper = zeros(3,1);
sqnr_theor = zeros(3,1);
[sqnr_exper(2), sqnr_theor(2)] = sqnr(x, xq_4_bits, 4, 0, 4, centers_4_bits);
[sqnr_exper(3), sqnr_theor(3)] = sqnr(x, xq_6_bits, 6, 0, 4, centers_6_bits);
 
%-------------------------------------------------------------------------%
%Ερώτημα 1-(b): Στο ερώτημα αυτό μας ζητήται να υπολογίσουμε την πιθανότητα
%εμφάνισης μια τιμής εκτός οριών της περιοχής του κβαντιστή. Δημιουργήσαμε
%ένα μετρητή τον οποίο ονομάσαμε offside και αυτος αυξανόταν κατά για τιμές
%μεγαλύτερες του 4 και μικρότερες του 0. Τέλος διαιρέσαμε με το 10000
%διότι το πλήθος των δειγμάτων μας είναι 10000 με σκοπό να υπολογίσουμε την
%ζητούμενη πιθανότητα.
p_uperfortosis = offside/10000;
%-------------------------------------------------------------------------%
 
%Επίσης εκτός απο την πιθανότητα εμφάνισης κάθε στάθμης του κβαντιστή  
%πρέπει να προσδιορίσουμε και την αποδοτικότητα του PCM για την πηγή A σε 
%κάθε περίπτωση. Για να το πετύχουμε αυτό γνωρίζουμε απο θεωρία ότι η
%απόδοση PCM δίνεται απο τον τύπο H(x)/N οπότε το θέμα ειναι να
%υπολογίσουμε την εντροπια σε κάθε περίπτωση. Αυτο το κανουμε μέσω της
%συνάρτησης Hx.
efficiency_pcm_A = zeros(3,1);
efficiency_pcm_A4 = Hx(space_p4)/4;
efficiency_pcm_A6 = Hx(space_p6)/6;
